#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>

```terraform
google_service_account.minecraft: Refreshing state... [id=projects/spatial-box-123118/serviceAccounts/minecraft@spatial-box-123118.iam.gserviceaccount.com]
google_compute_address.minecraft: Refreshing state... [id=projects/spatial-box-123118/regions/us-east1/addresses/minecraft-ip]
google_compute_network.minecraft: Refreshing state... [id=projects/spatial-box-123118/global/networks/minecraft]
google_compute_disk.minecraft: Refreshing state... [id=projects/spatial-box-123118/zones/us-east1-b/disks/minecraft]
google_compute_resource_policy.backup_policy: Refreshing state... [id=projects/spatial-box-123118/regions/us-east1/resourcePolicies/minecraft-backup-policy]
google_compute_disk_resource_policy_attachment.backup_policy_attachment: Refreshing state... [id=spatial-box-123118/us-east1-b/minecraft/minecraft-backup-policy]
google_compute_instance_template.minecraft: Refreshing state... [id=projects/spatial-box-123118/global/instanceTemplates/minecraft-template-20210228233852757500000001]
google_compute_firewall.minecraft: Refreshing state... [id=projects/spatial-box-123118/global/firewalls/minecraft]
google_compute_instance_group_manager.minecraft: Refreshing state... [id=projects/spatial-box-123118/zones/us-east1-b/instanceGroupManagers/minecraft]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_compute_instance_group_manager.minecraft will be created
  + resource "google_compute_instance_group_manager" "minecraft" {
      + base_instance_name = "minecraft"
      + fingerprint        = (known after apply)
      + id                 = (known after apply)
      + instance_group     = (known after apply)
      + name               = "minecraft"
      + operation          = (known after apply)
      + project            = (known after apply)
      + self_link          = (known after apply)
      + target_size        = 1
      + wait_for_instances = false
      + zone               = "us-east1-b"

      + update_policy {
          + max_surge_fixed         = (known after apply)
          + max_surge_percent       = (known after apply)
          + max_unavailable_fixed   = (known after apply)
          + max_unavailable_percent = (known after apply)
          + min_ready_sec           = (known after apply)
          + minimal_action          = (known after apply)
          + type                    = (known after apply)
        }

      + version {
          + instance_template = "https://www.googleapis.com/compute/beta/projects/spatial-box-123118/global/instanceTemplates/minecraft-template-20210228233852757500000001"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

------------------------------------------------------------------------

This plan was saved to: terraform.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "terraform.plan"


```
</details>
*Pusher: @davegallant, Action: `pull_request`*